adws/templates/root-DSE.xml

<s:Envelope
    xmlns:a="http://www.w3.org/2005/08/addressing" 
    xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</a:Action>
        <a:RelatesTo>{{MessageID}}</a:RelatesTo>
    </s:Header>
    <s:Body>
        <addata:top
            xmlns:ad="http://schemas.microsoft.com/2008/1/ActiveDirectory" 
            xmlns:addata="http://schemas.microsoft.com/2008/1/ActiveDirectory/Data" 
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
            xmlns:xsd="http://www.w3.org/2001/XMLSchema">

            {%- for attr in attrs %}
            {{attr.to_xml()|safe}}
            {%- endfor %}

        </addata:top>
    </s:Body>
</s:Envelope>
